app/controllers/students_controller.rb

  def create
    @student= Student.new(params.require(:student).permit(:first_name,:last_name))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-04-05 02:16:20.081294"], ["updated_at", "2018-04-05 02:16:20.081294"]]

  def update
    @student=Student.find(params[:id])
  #  @student.update(fist_name: params[:first_name], last_name: params[:last_name])
    @student.update(params.require(:student).permit(:first_name,:last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-04-05 02:23:10.213559"], ["id", 1]]